Revit 2027 API
PlanTopologySet.Contains Method
Tests for the existence of an item within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	PlanTopology item
)
Public Overridable Function Contains (
	item As PlanTopology
) As Boolean
public:
virtual bool Contains(
	PlanTopology^ item
)
abstract Contains :
        item : PlanTopology -> bool
override Contains :
        item : PlanTopology -> bool
Parameters
item PlanTopology
The item to be searched for.
Return Value
Boolean
The Contains method returns True if the item is within the set, otherwise False.
See Also
Reference
PlanTopologySet Class
Autodesk.Revit.DB Namespace